import pandas as pd
df_values = [['S&P 500', 'Dec 01, 2023', '4,559.43', '4,594.63'],
       ['NASDAQ Composite', 'Dec 01, 2023', '14,181.35', '14,305.03'],
       ['Dow Jones Industrial Average', 'Dec 01, 2023', '35,914.45', '36,245.50'],
       ['S&P 500', 'Nov 30, 2023', '4,554.87', '4,567.80'],
       ['NASDAQ Composite', 'Nov 30, 2023', '14,265.05', '14,226.22'],
       ['Dow Jones Industrial Average', 'Nov 30, 2023', '35,596.57', '35,950.89'],
       ['S&P 500', 'Nov 29, 2023', '4,571.84', '4,550.58'],
       ['NASDAQ Composite', 'Nov 29, 2023', '14,367.11', '14,258.49'],
       ['Dow Jones Industrial Average', 'Nov 29, 2023', '35,436.80', '35,430.42'],
       ['S&P 500', 'Nov 28, 2023', '4,545.55', '4,554.89'],
       ['NASDAQ Composite', 'Nov 28, 2023', '14,224.63', '14,281.76'],
       ['Dow Jones Industrial Average', 'Nov 28, 2023', '35,332.13', '35,416.98'],
       ['S&P 500', 'Nov 27, 2023', '4,554.86', '4,550.43'],
       ['NASDAQ Composite', 'Nov 27, 2023', '14,239.31', '14,241.02'],
       ['Dow Jones Industrial Average', 'Nov 27, 2023', '35,376.44', '35,333.47']]
df_columns = ['Exchange Index', 'Date', 'Open', 'Close']
df = pd.DataFrame(df_values, columns=df_columns)
df.set_index('Exchange Index', inplace=True)

# filter fegex
# print(df.head())
# print(df.filter(regex='^NAS', axis=0))

# print(df.filter(like='NASDAQ Composite', axis=0))

# print(
#        df
#        .assign(date = df['Date'].astype("datetime64[ns]"))
#        .query('date == "2023-11-29"')
#        .drop('date', axis=1)
#        .sort_index()
# )

df_values = [['AMEZ', 'ПАО "Ашинский метзавод"', 'ао', 51480414016, 'металлургия'],
       ['BSPB', 'ПАО "Банк "Санкт-Петербург"', 'ао', 134333130048, 'банк'],
       ['BSPBP', 'ПАО "Банк "Санкт-Петербург"', 'ап', 1234140000, 'банк'],
       ['CHMF', 'ПАО "Северсталь"', 'ао', 1147004389272, 'металлургия'],
       ['CHMK', 'ПАО "ЧМК"', 'ао', 35398198175, 'металлургия'],
       ['GMKN', 'ПАО "ГМК "Норильский никель"', 'ао', 2474552670636, 'металлургия'],
       ['MAGN', 'ПАО "ММК"', 'ао', 583970485800, 'металлургия'],
       ['MTLR', 'ПАО "Мечел"', 'ао', 85098228400, 'металлургия'],
       ['MTLRP', 'ПАО "Мечел"', 'ап', 31456192630, 'металлургия'],
       ['NLMK', 'ПАО "НЛМК"', 'ао', 1255940700414, 'металлургия'],
       ['ROSB', 'ПАО РОСБАНК', 'ао', 158242989006, 'банк'],
       ['RUAL', 'МКПАО "ОК РУСАЛ"', 'ао', 626180107537, 'металлургия'],
       ['SBER', 'ПАО Сбербанк', 'ао', 5628796691000, 'банк'],
       ['SBERP', 'ПАО Сбербанк', 'ап', 260380000000, 'банк'],
       ['TRMK', 'ПАО "ТМК"', 'ао', 229500690203, 'металлургия'],
       ['USBN', 'ПАО "БАНК УРАЛСИБ"', 'ао', 71090589258, 'банк'],
       ['VTBR', 'Банк ВТБ (ПАО)', 'ао', 693929707327, 'банк']]
df_columns = ['Торговый код', 'Эмитент', 'Тип',
              'Капитализация, руб.', 'Отрасль']
df = pd.DataFrame(df_values, columns=df_columns)
df.set_index('Торговый код', inplace=True)

# print(
#        df
#        .assign(Отрасль = df['Отрасль']
#               .str.replace('металлургия', 'М')
#               .str.replace('банк', 'Б'))
# )

print(
       df.filter(regex='^[MS]', axis=0)
)