import pandas as pd
import numpy as np 

bitcoin_values = [['2022-01-01', 46311.75, 47881.41, 33184.06, 38483.12, 923979037681],
       ['2022-02-01', 38481.77, 45661.17, 34459.22, 43193.23, 671335993325],
       ['2022-03-01', 43194.5, 48086.84, 37260.2, 45538.68, 830943838435],
       ['2022-04-01', 45554.16, 47313.48, 37697.94, 37714.88, 830115888649],
       ['2022-05-01', 37713.27, 39902.95, 26350.49, 31792.31, 1105689315990],
       ['2022-06-01', 31792.55, 31957.29, 17708.62, 19784.73, 923939211678],
       ['2022-07-01', 19820.47, 24572.58, 18966.95, 23336.9, 927582363389],
       ['2022-08-01', 23336.72, 25135.59, 19600.79, 20049.76, 894192654543],
       ['2022-09-01', 20050.5, 22673.82, 18290.31, 19431.79, 1123272250385],
       ['2022-10-01', 19431.11, 20988.39, 18319.82, 20495.77, 957903424925],
       ['2022-11-01', 20494.9, 21446.89, 15599.05, 17168.57, 1224531549126],
       ['2022-12-01', 17168.0, 18318.53, 16398.14, 16547.5, 541356716034],
       ['2023-01-01', 16547.91, 23919.89, 16521.23, 23139.28, 690994018045],
       ['2023-02-01', 23137.84, 25134.12, 21460.09, 23147.35, 723968574897],
       ['2023-03-01', 23150.93, 29159.9, 19628.25, 28478.48, 883299703608],
       ['2023-04-01', 28473.33, 31005.61, 27070.85, 29268.81, 511540319004],
       ['2023-05-01', 29227.1, 29820.13, 25878.43, 27219.66, 443473015479],
       ['2023-06-01', 27218.41, 31389.54, 24797.17, 30477.25, 481734214225]]
bitcoin_columns = ['Date', 'Open', 'High', 'Low', 'Close', 'Volume']
bitcoin = pd.DataFrame(bitcoin_values, columns=bitcoin_columns)

# print(
#     bitcoin
#     .drop(['Volume'], axis=1)
#     .tail(6)
# )

# -------------------------------------------

moscow_exchange_values = [['2023-03-10', 2276.25, 2272.61, 2283.18, 2266.33, -0.61, np.nan, np.nan],
       ['2023-03-09', 2290.14, 2295.03, 2302.1, 2278.95, -0.24, np.nan, np.nan],
       ['2023-03-07', 2295.6, 2294.32, 2298.93, 2281.46, 0.06, np.nan, np.nan],
       ['2023-03-06', 2294.12, 2286.2, 2297.86, 2283.4, 0.96, np.nan, np.nan],
       ['2023-03-03', 2272.2, 2250.12, 2273.52, 2249.81, 0.79, np.nan, np.nan],
       ['2023-03-02', 2254.3, 2284.87, 2286.27, 2235.43, -1.11, np.nan, np.nan],
       ['2023-03-01', 2279.65, 2258.89, 2287.48, 2255.45, 1.18, np.nan, np.nan]]
moscow_exchange_columns = ['Дата', 'Цена', 'Откр.', 'Макс.', 'Мин.', 'Изм. %', 'Unnamed: 6', 'Unnamed: 7']
moex = pd.DataFrame(moscow_exchange_values, columns=moscow_exchange_columns)  

# print(
#     moex
#     .drop(['Unnamed: 6', 'Unnamed: 7'], axis=1)
# )

# --------------------------------------------------------------
pmi_manufacturing_russia_values = [['01.07.2024 (июнь)', 54.9, np.nan, 54.4],
                                   ['03.06.2024 (май)', 54.4, np.nan, 54.3],
                                   ['02.05.2024 (апр)', 54.3, np.nan, 55.7],
                                   ['01.04.2024 (мар)', 55.7, np.nan, 54.7],
                                   ['01.03.2024 (фев)', 54.7, np.nan, 52.4],
                                   ['01.02.2024 (янв)', 52.4, np.nan, 54.6],
                                   ['29.12.2023 (дек)', 54.6, np.nan, 53.8],
                                   ['01.12.2023 (нояб)', 53.8, np.nan, 53.8],
                                   ['01.11.2023 (окт)', 53.8, np.nan, 54.5],
                                   ['02.10.2023 (сент)', 54.5, np.nan, 52.7],
                                   ['01.09.2023 (авг)', 52.7, np.nan, 52.1],
                                   ['01.08.2023 (июль)', 52.1, np.nan, 52.6],
                                   ['03.07.2023 (июнь)', 52.6, np.nan, 53.5],
                                   ['01.06.2023 (май)', 53.5, np.nan, 52.6],
                                   ['02.05.2023 (апр)', 52.6, np.nan, 53.2],
                                   ['03.04.2023 (мар)', 53.2, np.nan, 53.6],
                                   ['01.03.2023 (фев)', 53.6, np.nan, 52.6],
                                   ['01.02.2023 (янв)', 52.6, np.nan, 53.0]]
pmi_manufacturing_russia_columns = ['Дата выпуска', 'Факт.', 'Прогноз', 'Пред.']
pmi_manufacturing_russia = pd.DataFrame(pmi_manufacturing_russia_values, columns=pmi_manufacturing_russia_columns)

# print(
#     pmi_manufacturing_russia
#     .drop(['Прогноз', 'Пред.'], axid=1)
# )

# ---------------------------------------------------------
interest_rates_values = [['Австралия', 'Резервный банк Австралии', 4.1, '06.06.2023'],
       ['Бразилия', 'Центральный банк Бразилии', 13.75, '04.08.2022'],
       ['Великобритания', 'Банк Англии', 5.0, '22.06.2023'],
       ['Дания', 'Национальный банк Дании', 3.25, '15.06.2023'],
       ['Еврозона', 'Европейский центральный банк', 4.0, '15.06.2023'],
       ['Индия', 'Резервный банк Индии', 6.5, '08.02.2023'],
       ['Канада', 'Банк Канады', 5.0, '12.07.2023'],
       ['Китай', 'Народный банк Китая', 3.55, '20.06.2023'],
       ['Мексика', 'Банк Мексики', 11.25, '30.03.2023'],
       ['Новая Зеландия', 'Резервный банк Новой Зеландии', 5.5,
        '24.05.2023'],
       ['Россия', 'Центральный банк Российской Федерации', 8.5,
        '24.07.2023'],
       ['США', 'Федеральная резервная система', 5.25, '04.05.2023'],
       ['Турция', 'Центральный банк Турции', 17.5, '20.07.2023'],
       ['Швейцария', 'Национальный банк Швейцарии', 1.75, '22.06.2023'],
       ['Швеция', 'Банк Швеции', 3.75, '30.06.2023'],
       ['ЮАР', 'Южно-Африканский резервный банк', 8.25, '25.05.2023'],
       ['Япония', 'Банк Японии', -0.1, '03.08.2016']]
interest_rates_columns = ['Страна', 'Банк', 'Ставка', 'Дата вступления в силу']
interest_rates = pd.DataFrame(interest_rates_values, columns=interest_rates_columns)

print(
    interest_rates
    .query('Ставка > 8')
    .reset_index(drop=True)
    .drop(['Банк'], axis=1)
)