import pandas as pd 
import numpy as np 

cbr_values = [['2023-10-03', 13.4955, 103.868, 98.4785],
       ['2023-10-04', 13.5556, 104.0621, 99.2677],
       ['2023-10-05', 13.5779, 104.3024, 99.4555],
       ['2023-10-06', 13.6183, 104.7877, 99.6762],
       ['2023-10-07', 13.7373, 106.01, 100.4911],
       ['2023-10-08', np.nan, np.nan, 100.4911],
       ['2023-10-09', np.nan, np.nan, 100.4911],
       ['2023-10-10', 13.8926, 107.0322, 101.3598],
       ['2023-10-11', 13.6821, 105.6864, 99.9349],
       ['2023-10-12', 13.6982, 105.9544, 99.9808],
       ['2023-10-13', 13.284, 103.035, 96.9948],
       ['2023-10-14', 13.3026, 102.5523, 97.3075],
       ['2023-10-15', np.nan, 102.5523, np.nan],
       ['2023-10-16', np.nan, np.nan, np.nan],
       ['2023-10-17', 13.2893, 102.52, 97.2865]]
cbr_columns = ['date', 'cny', 'eur', 'usd']
df = pd.DataFrame(cbr_values, columns=cbr_columns)

# print(df.assign(date=lambda x: x['date'].astype('datetime64[ns]')).info())

# ------------------------------------
#dropna
# print(df.dropna(subset=['eur']))
# ---------------------------------------
# duplicated 
df_values = [['2022-01-01', 7499847, 54470, 1955876, 44457082, 53967274],
       ['2022-04-01', 3645028, 31379, 1735592, 35088849, 40500848],
       ['2022-07-01', 3339145, 24044, 1515876, 30349707, 35228772],
       ['2022-07-01', 3339145, 24044, 1515876, 30349707, 35228772],       
       ['2022-10-01', 2880189, 24673, 1116427, 24933981, 28955270],
       ['2023-01-01', 3665860, 27803, 1351467, 27236686, 32281816],
       ['2023-04-01', 5541864, 31702, 1529441, 29407970, 36510976],
       ['2023-04-01', 5541864, 31702, 1529441, 29407970, 36510976],      
       ['2023-07-01', 6179887, 43765, 1682005, 32973351, 40879009],
       ['2023-10-01', 6954891, 61577, 1988761, 37355293, 46360522],
       ['2023-10-01', 6954891, 61577, 1988761, 37355293, 46360522]]
df_columns = ['Дата', 'Кредитные организации', 'Страховщики', 'Другие финансовые организации', 
              'Нефинансовые организации', 'Итого']
# df = pd.DataFrame(df_values, columns=df_columns).assign(Дата = lambda x: x['Дата'].astype('datetime64[ns]'))
# print(df.info())

# print(df.duplicated(subset='Страховщики'))

# ---------------------------- HomeTasks -----------------------------
df_values = [['Северо-Кавказский', 576, 19, 265], ['Южный', 2860, 122, np.nan],
             ['Центральный', 4826, 83, 1965], ['Приволжский', 4826, 123, np.nan],
             ['Северо-Западный', 2146, 35, 740], ['Уральский', 1932, 82, 867],
             ['Сибирский', 1211, 24, 490]]
df_columns = ['Федеральный округ', 'Магазины у дома', 'Супермаркеты', 'Дрогери']
df = pd.DataFrame(df_values, columns=df_columns)

print(df[df.isna().any(axis=1)])

# ------------------------------------------------
df_values = [['Северо-Кавказский', 576, 19, 265], ['Южный', 2860, 122, np.nan],
             ['Центральный', 4826, 83, 1965], ['Приволжский', 4826, 123, np.nan],
             ['Северо-Западный', 2146, 35, 740], ['Уральский', 1932, 82, 867],
             ['Сибирский', 1211, 24, 490]]
df_columns = ['Федеральный округ', 'Магазины у дома', 'Супермаркеты', 'Дрогери']
df = pd.DataFrame(df_values, columns=df_columns)

# print(
#     df
#     .dropna()
#     .assign(Дрогери = lambda x: x['Дрогери'].astype('int64'))
# )
# ------------------------------------------------------------------
df_values = [['Северо-Кавказский', 576, 19, 265], ['Южный', 2860, 122, np.nan],
             ['Центральный', 4826, 83, 1965], ['Приволжский', 4826, 123, np.nan],
             ['Северо-Западный', 2146, 35, 740], ['Уральский', 1932, 82, 867],
             ['Сибирский', 1211, 24, 490]]
df_columns = ['Федеральный округ', 'Магазины у дома', 'Супермаркеты', 'Дрогери']
df = pd.DataFrame(df_values, columns=df_columns)

print('---------------------------------------')
print(
    df
    .set_index('Федеральный округ')
    .transpose()
    .assign(Южный=lambda x: x['Южный'].fillna(1352),
            Приволжский=lambda x: x['Приволжский'].fillna(1904) )
    .transpose()
    .astype('int64')
    .reset_index()
)

print('-'*60)
df_values = [['Nov 30, 2023', 2038.10, 25.29, 931.20],
             ['Nov 29, 2023', 2047.10, 25.07, 936.40],
             ['Nov 28, 2023', 2039.70, 24.93, 944.10],
             ['Nov 27, 2023', 2011.80, 24.67, 917.10],
             ['Nov 24, 2023', 2002.20, 24.33, 931.10],
             ['Nov 23, 2023', 1991.50, np.nan, np.nan],
             ['Nov 22, 2023', 1991.40, 23.67, 924.60],
             ['Nov 21, 2023', 1999.30, 23.84, 940.00],
             ['Nov 20, 2023', 1977.70, 23.58, 921.50],
             ['Nov 17, 2023', 1981.60, 23.81, 894.70],
             ['Nov 16, 2023', 1983.90, 23.89, 897.10],
             ['Nov 15, 2023', 1960.10, 23.48, 895.30]]
df_columns = ['Date', 'Gold', 'Silver', 'Platinum']
df = pd.DataFrame(df_values, columns=df_columns).set_index('Date')

print(df.mean())
print(
    df.fillna(df.mean(axis=0))
)